
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 8-core  perpetual
Serial number: 501706320757
  Licensed to: Joao Pedro Azevedo
               Personal

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do c:\GitHub\myados\wbopendata\test_options_AD_140.do 

. * Options A and D with maxlength 180
. clear all
r; t=0.03 16:01:52

. 
. wbopendata, indicator(SI.POV.DDAY; SH.DYN.MORT) clear long latest ///
>     linewrap(name description note) maxlength(40 180 180)

    Metadata for indicator SI.POV.DDAY
-------------------------------------------------------------------------------
    Name: Poverty headcount ratio at $3.00 a day (2021 PPP) (% of
    population)
-------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-------------------------------------------------------------------------------
    Description: Poverty headcount ratio at $3.00 a day is the percentage
    of the population living on less than $3.00 a day at 2021 purchasing
    power adjusted prices. As a result of revisions in PPP exchange rates,
    poverty rates for individual countries cannot be compared with poverty
    rates reported in earlier editions.
-------------------------------------------------------------------------------
    Note: World Bank, Poverty and Inequality Platform. Data are based on
    primary household survey data obtained from government statistical
    agencies and World Bank country departments. Data for high-income
    economies are mostly from the Luxembourg Income Study database. For
    more information and methodology, please see http://pip.worldbank.org.,
    World Bank (WB), uri: http://pip.worldbank.org, note: Data are based on
    primary household survey data obtained from government statistical
    agencies and World Bank country departments. Data for high-income
    economies are mostly from the Luxembourg Income Study database.
-------------------------------------------------------------------------------
    Topic(s): 11 Poverty ; 2 Aid Effectiveness ; 19 Climate Change
-------------------------------------------------------------------------------



    Metadata for indicator SH.DYN.MORT
-------------------------------------------------------------------------------
    Name: Mortality rate, under-5 (per 1,000 live births)
-------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-------------------------------------------------------------------------------
    Description: Under-five mortality rate is the probability per 1,000
    that a newborn baby will die before reaching age five, if subject to
    age-specific mortality rates of the specified year.
-------------------------------------------------------------------------------
    Note: UN Inter-agency Group for Child Mortality Estimation, UN
    Children's Fund (UNICEF), uri: http://www.childmortality.org,
    publisher: UNICEF, WHO, World Bank, United Nations Population Division;
-------------------------------------------------------------------------------
    Topic(s):
-------------------------------------------------------------------------------


    Note: Kept 186 countries with latest year where all 2 indicators are
    non-missing.
r; t=6.68 16:01:59

. 
. * Store all returns with compound quotes
. local name1 `"`r(name1_stack)'"'
r; t=0.00 16:01:59

. local name2 `"`r(name2_stack)'"'
r; t=0.00 16:01:59

. local desc1 `"`r(description1_stack)'"'
r; t=0.00 16:01:59

. local desc2 `"`r(description2_stack)'"'
r; t=0.00 16:01:59

. local src1 "`r(sourcecite1)'"
r; t=0.00 16:01:59

. local src2 "`r(sourcecite2)'"
r; t=0.00 16:01:59

. local subtitle "`r(latest_subtitle)'"
r; t=0.00 16:01:59

. 
. * Option A: Using caption for descriptions and note for sources
. di _n "=== Option A: caption + note ==="

=== Option A: caption + note ===
r; t=0.00 16:01:59

. twoway (scatter sh_dyn_mort si_pov_dday, msize(small) mcolor(blue%50)), ///
>     xtitle(`name1', size(small)) ///
>     ytitle(`name2', size(small)) ///
>     title("Poverty and Child Mortality", size(medium)) ///
>     subtitle("`subtitle'", size(small)) ///
>     caption("{bf:Indicator Descriptions:}" ///
>             "{bf:X-axis:} " `desc1' ///
>             "{bf:Y-axis:} " `desc2', size(vsmall) span) ///
>     note("Sources: `src1'; `src2'", size(vsmall))
r; t=1.35 16:02:01

. 
. graph export "test_optionA_140.png", replace
file test_optionA_140.png saved as PNG format
r; t=0.20 16:02:01

. 
. * Option D: Use sourcecite for clean source attribution
. * Note: Full notes contain SMCL {browse ...} tags that don't render in graphs
. * Using sourcecite returns which are plain text
. 
. * Option D: subtitle for short info, caption for descriptions, note for separ
> ate sources
. di _n "=== Option D: subtitle + caption + note (separate sources) ==="

=== Option D: subtitle + caption + note (separate sources) ===
r; t=0.00 16:02:01

. twoway (scatter sh_dyn_mort si_pov_dday, msize(small) mcolor(blue%50)), ///
>     xtitle(`name1', size(small)) ///
>     ytitle(`name2', size(small)) ///
>     title("Poverty and Child Mortality", size(medium)) ///
>     subtitle("`subtitle'", size(small)) ///
>     caption("{bf:Definitions:}" ///
>             "{bf:X-axis:} " `desc1' ///
>             "{bf:Y-axis:} " `desc2', size(vsmall) span) ///
>     note("{bf:Data Sources:}" ///
>          "{bf:X (Poverty):} `src1'" ///
>          "{bf:Y (Mortality):} `src2'", size(vsmall))
r; t=0.72 16:02:02

. 
. graph export "test_optionD_140.png", replace
file test_optionD_140.png saved as PNG format
r; t=0.18 16:02:02

. 
. * Option E: Sources labeled on separate lines in note
. di _n "=== Option E: separate source lines in note ==="

=== Option E: separate source lines in note ===
r; t=0.00 16:02:02

. 
. twoway (scatter sh_dyn_mort si_pov_dday, msize(small) mcolor(blue%50)), ///
>     xtitle(`name1', size(small)) ///
>     ytitle(`name2', size(small)) ///
>     title("Poverty and Child Mortality", size(medium)) ///
>     subtitle("`subtitle'", size(small)) ///
>     caption("{bf:Definitions:}" ///
>             "{bf:X-axis:} " `desc1' ///
>             "{bf:Y-axis:} " `desc2', size(vsmall) span) ///
>     note("{bf:Data Sources:}" ///
>          "{bf:X (Poverty):} `src1'" ///
>          "{bf:Y (Mortality):} `src2'", size(vsmall) span)
r; t=0.66 16:02:03

. 
. graph export "test_optionE_140.png", replace
file test_optionE_140.png saved as PNG format
r; t=0.16 16:02:03

. 
. * Option F: Short sourcecite on one line
. di _n "=== Option F: short sourcecite on one line ==="

=== Option F: short sourcecite on one line ===
r; t=0.00 16:02:03

. 
. twoway (scatter sh_dyn_mort si_pov_dday, msize(small) mcolor(blue%50)), ///
>     xtitle(`name1', size(small)) ///
>     ytitle(`name2', size(small)) ///
>     title("Poverty and Child Mortality", size(medium)) ///
>     subtitle("`subtitle'", size(small)) ///
>     caption("{bf:Definitions:}" ///
>             "{bf:X-axis:} " `desc1' ///
>             "{bf:Y-axis:} " `desc2', size(vsmall) span) ///
>     note("{bf:Data Sources:}  X: `src1';  Y: `src2'", size(vsmall) span)
r; t=0.71 16:02:04

. 
. graph export "test_optionF_140.png", replace
file test_optionF_140.png saved as PNG format
r; t=0.15 16:02:04

. 
. 
. 
. 
. 
. * Option G: Sources in caption (separate lines)
. di _n "=== Option G: sources in caption (separate lines) ==="

=== Option G: sources in caption (separate lines) ===
r; t=0.00 16:02:04

. 
. twoway (scatter sh_dyn_mort si_pov_dday, msize(small) mcolor(blue%50)), ///
>     xtitle(`name1', size(small)) ///
>     ytitle(`name2', size(small)) ///
>     title("Poverty and Child Mortality", size(medium)) ///
>     subtitle("`subtitle'", size(small)) ///
>     caption("{bf:Definitions:}" ///
>             "{bf:X-axis:} " `desc1' ///
>             "{bf:Y-axis:} " `desc2' "" ///
>             "{bf:Data Sources:}" ///
>             "{bf:X (Poverty):} `src1'" ///
>             "{bf:Y (Mortality):} `src2'", size(vsmall) span)
r; t=0.73 16:02:05

. 
. graph export "test_optionG_140.png", replace
file test_optionG_140.png saved as PNG format
r; t=0.16 16:02:05

. 
. 
. 
. * Option H: Short sourcecite in caption
. wbopendata, indicator(SI.POV.DDAY; SH.DYN.MORT) clear long latest ///
>     linewrap(name description note) maxlength(40 180 180)

    Metadata for indicator SI.POV.DDAY
-------------------------------------------------------------------------------
    Name: Poverty headcount ratio at $3.00 a day (2021 PPP) (% of
    population)
-------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-------------------------------------------------------------------------------
    Description: Poverty headcount ratio at $3.00 a day is the percentage
    of the population living on less than $3.00 a day at 2021 purchasing
    power adjusted prices. As a result of revisions in PPP exchange rates,
    poverty rates for individual countries cannot be compared with poverty
    rates reported in earlier editions.
-------------------------------------------------------------------------------
    Note: World Bank, Poverty and Inequality Platform. Data are based on
    primary household survey data obtained from government statistical
    agencies and World Bank country departments. Data for high-income
    economies are mostly from the Luxembourg Income Study database. For
    more information and methodology, please see http://pip.worldbank.org.,
    World Bank (WB), uri: http://pip.worldbank.org, note: Data are based on
    primary household survey data obtained from government statistical
    agencies and World Bank country departments. Data for high-income
    economies are mostly from the Luxembourg Income Study database.
-------------------------------------------------------------------------------
    Topic(s): 11 Poverty ; 2 Aid Effectiveness ; 19 Climate Change
-------------------------------------------------------------------------------



    Metadata for indicator SH.DYN.MORT
-------------------------------------------------------------------------------
    Name: Mortality rate, under-5 (per 1,000 live births)
-------------------------------------------------------------------------------
    Collection: 2 World Development Indicators
-------------------------------------------------------------------------------
    Description: Under-five mortality rate is the probability per 1,000
    that a newborn baby will die before reaching age five, if subject to
    age-specific mortality rates of the specified year.
-------------------------------------------------------------------------------
    Note: UN Inter-agency Group for Child Mortality Estimation, UN
    Children's Fund (UNICEF), uri: http://www.childmortality.org,
    publisher: UNICEF, WHO, World Bank, United Nations Population Division;
-------------------------------------------------------------------------------
    Topic(s):
-------------------------------------------------------------------------------


    Note: Kept 186 countries with latest year where all 2 indicators are
    non-missing.
r; t=4.77 16:02:10

. 
. local name1 `"`r(name1_stack)'"'
r; t=0.00 16:02:10

. local name2 `"`r(name2_stack)'"'
r; t=0.00 16:02:10

. local desc1 `"`r(description1_stack)'"'
r; t=0.00 16:02:10

. local desc2 `"`r(description2_stack)'"'
r; t=0.00 16:02:10

. local src1 "`r(sourcecite1)'"
r; t=0.00 16:02:10

. local src2 "`r(sourcecite2)'"
r; t=0.00 16:02:10

. local subtitle "`r(latest_subtitle)'"
r; t=0.00 16:02:10

. 
. di _n "=== Option H: short sourcecite in caption ==="

=== Option H: short sourcecite in caption ===
r; t=0.00 16:02:10

. 
. * Option H: Definitions + short sourcecite all in caption
. twoway (scatter sh_dyn_mort si_pov_dday, msize(small) mcolor(blue%50)), ///
>     xtitle(`name1', size(small)) ///
>     ytitle(`name2', size(small)) ///
>     title("Poverty and Child Mortality", size(medium)) ///
>     subtitle("`subtitle'", size(small)) ///
>     caption("{bf:Definitions:}" ///
>             "{bf:X-axis:} " `desc1' ///
>             "{bf:Y-axis:} " `desc2' ///
>             "{bf:Data Sources:}  X: `src1';  Y: `src2'", size(vsmall) span)
r; t=0.66 16:02:10

. 
. graph export "test_optionH_140.png", replace
file test_optionH_140.png saved as PNG format
r; t=0.18 16:02:10

. 
. di _n "=== All options exported ==="

=== All options exported ===
r; t=0.00 16:02:10

. 
end of do-file
r; t=18.10 16:02:10
